In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("Dataset_03.csv")

In [5]:
from sklearn.model_selection import train_test_split

In [7]:
train, test = train_test_split(df, random_state=123, test_size=0.3)

In [14]:
from sklearn.linear_model import LogisticRegression

In [15]:
from sklearn.metrics import accuracy_score

In [16]:
var = df.columns.drop("gender")

In [17]:
logit = LogisticRegression().fit(X = df[var],
                                 y = df['gender'])

In [25]:
from sklearn.metrics import precision_score, classification_report

In [26]:
pred = logit.predict(test[var])

In [28]:
print(classification_report(test.gender, pred))

              precision    recall  f1-score   support

      Female       0.97      0.96      0.97       743
        Male       0.96      0.97      0.97       758

    accuracy                           0.97      1501
   macro avg       0.97      0.97      0.97      1501
weighted avg       0.97      0.97      0.97      1501

In [89]:
df=pd.read_csv("Dataset_04.csv")

In [90]:
df.head(2)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591

In [91]:
df['LOCATION'] == 'KOR'

0       False
1       False
2       False
3       False
4       False
        ...
6713    False
6714    False
6715    False
6716    False
6717    False
Name: LOCATION, Length: 6718, dtype: bool

In [37]:
df.loc[df['LOCATION'] == 'KOR'].corr()

           TIME     Value
TIME   1.000000  0.326711
Value  0.326711  1.000000

In [38]:
0.327

0.327

In [99]:
q = df[df.LOCATION.isin(['KOR', 'JPN'])]

In [100]:
q.head(2)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055

In [101]:
q2 = pd.pivot_table(q, index=['TIME', 'SUBJECT'],
                    columns='LOCATION', values='Value')

In [102]:
q2.head(10)

LOCATION            JPN        KOR
TIME SUBJECT
1990 BEEF      6.111035        NaN
     PIG      13.219006        NaN
     POULTRY  12.844865   5.570102
     SHEEP     0.756696   0.204153
1991 BEEF      6.517055   5.085481
     PIG      13.239267   9.930182
     POULTRY  12.055422   6.738203
     SHEEP     0.772785   0.157341
1992 BEEF      6.766244   5.685434
     PIG      13.233312  13.366378

In [103]:
from scipy.stats import ttest_rel

In [104]:
q2.dropna()

LOCATION            JPN        KOR
TIME SUBJECT
1990 POULTRY  12.844865   5.570102
     SHEEP     0.756696   0.204153
1991 BEEF      6.517055   5.085481
     PIG      13.239267   9.930182
     POULTRY  12.055422   6.738203
...                 ...        ...
2025 SHEEP     0.125060   0.201451
2026 BEEF      6.844875  10.737425
     PIG      15.544018  29.544063
     POULTRY  14.768340  17.907865
     SHEEP     0.122136   0.202656

[146 rows x 2 columns]

In [108]:
q2_out=ttest_rel(q2['KOR'], q2['JPN'])

In [110]:
q2_out.statistic

nan

In [128]:
import pandas as pd

In [129]:
df = pd.read_csv("Dataset_04.csv")

In [141]:
df1=df.loc[df['LOCATION']=='KOR']
data4 = pd.pivot_table(df1, index='TIME', 
                       values='Value', 
                       aggfunc='sum').reset_index()
df2=df.loc[(df['LOCATION']=='KOR')|(df['LOCATION']=='JPN')]
data2=pd.pivot_table(df2, index=['SUBJECT', 'TIME'], 
                     columns='LOCATION', 
                     values='Value')
data2=data2.dropna()
from scipy.stats import ttest_rel
ttest_rel(data2['KOR'], data2['JPN'])

In [148]:
data4 = pd.pivot_table(df1, index='TIME', 
                       values='Value', 
                       aggfunc='sum').reset_index()

In [156]:
df2=df.loc[(df['LOCATION']=='KOR')|(df['LOCATION']=='JPN')]

In [165]:
data2=pd.pivot_table(df2, index=['SUBJECT', 'TIME'], 
                     columns='LOCATION', 
                     values='Value')

In [168]:
data2=data2.dropna()

In [169]:
data2.head(5)

LOCATION           JPN       KOR
SUBJECT TIME
BEEF    1991  6.517055  5.085481
        1992  6.766244  5.685434
        1993  7.406407  5.325765
        1994  8.129090  5.698819
        1995  8.535522  6.568429

In [170]:
from scipy.stats import ttest_rel

In [174]:
ttest_rel(data2['KOR'], data2['JPN'])

Ttest_relResult(statistic=5.662768873304346, pvalue=7.731889627475098e-08)

In [175]:
import pandas as pd

In [176]:
df=pd.read_csv("Dataset_04.csv")

In [183]:
df.head(2)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591

In [178]:
df1 = df.loc[df['LOCATION']=='KOR']

In [192]:
data1 = pd.pivot_table(df1, 
                       index='TIME',
                       values='Value',
                        aggfunc='sum').reset_index()

In [193]:
data1.head(2)

   TIME      Value
0  1990   5.774255
1  1991  21.911207

In [194]:
data1.corr()

           TIME     Value
TIME   1.000000  0.960124
Value  0.960124  1.000000

In [195]:
df1 = df.loc[(df['LOCATION']=='KOR')|(df['LOCATION']=='JPN')]

In [196]:
df1.head(2)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055

In [198]:
data2=pd.pivot_table(df1, 
                     index=['TIME','SUBJECT'],
                     columns='LOCATION', 
                     values='Value')

In [199]:
data2.head(2)

LOCATION            JPN  KOR
TIME SUBJECT
1990 BEEF      6.111035  NaN
     PIG      13.219006  NaN

In [200]:
from scipy.stats import ttest_rel

In [206]:
data2=data2.dropna().reset_index()

In [207]:
ttest_rel(data2['KOR'], data2['JPN'])

Ttest_relResult(statistic=5.662768873304346, pvalue=7.731889627475098e-08)

In [250]:
from sklearn.linear_model import LinearRegression
df1 = df.loc[(df['LOCATION']=='KOR')]
sub_list = df1.SUBJECT.unique()
for i in sub_list:
    temp=df1[df1.SUBJECT==i]
    model = LinearRegression().fit(temp[['TIME']], temp['Value'])
    pred=model.predict(temp[['TIME']])
    r2 = model.score(temp[['TIME']], temp['Value'])
    mape=(abs(temp['Value']-pred)/temp['Value']).sum()*100/len(temp)
    print(r2)
    print(mape)

0.835455805530312
7.310893225858995
0.9406814424683864
5.634979881649262
0.9514978845444608
5.783357902874552
0.004082992795654383
33.3479658130492

In [218]:
df1 = df.loc[(df['LOCATION']=='KOR')]

In [219]:
sub_list = df1.SUBJECT.unique()

In [232]:
print(sub_list)

['BEEF' 'PIG' 'POULTRY' 'SHEEP']

In [235]:
for i in sub_list:
    temp=df1[df1.SUBJECT==i]
    model = LinearRegression().fit(temp[['TIME']], temp['Value'])
    pred=model.predict(temp[['TIME']])
    r2 = model.score(temp[['TIME']], temp['Value'])
    mape=(abs(temp['Value']-pred)/temp['Value']).sum()*100/len(temp)
    print(r2)
    print(mape)

0.835455805530312
7.310893225858995
0.9406814424683864
5.634979881649262
0.9514978845444608
5.783357902874552
0.004082992795654383
33.3479658130492

In [229]:
print(r2)

0.004082992795654383

In [236]:
5.783357902874552

5.783357902874552

In [237]:
df1.head(2)

    LOCATION SUBJECT  TIME     Value
442      KOR    BEEF  1991  5.085481
443      KOR    BEEF  1992  5.685434

In [239]:
df1=df1.loc[df['LOCATION']=="KOR"]

In [244]:
var=df1.SUBJECT.unique()

In [245]:
print(var)

['BEEF' 'PIG' 'POULTRY' 'SHEEP']

In [256]:
for i in var:
    temp=df1.loc[df['SUBJECT']==i]
    model=LinearRegression().fit(temp[['TIME']], temp['Value'])
    pred=model.predict(temp[['TIME']] )
    r2=model.score(temp[['TIME']],temp['Value'])
    mape=(abs(temp['Value']-pred)/temp['Value']).sum()*100/len(temp)
    print(r2)
    print(mape)

0.835455805530312
7.310893225858995
0.9406814424683864
5.634979881649262
0.9514978845444608
5.783357902874552
0.004082992795654383
33.3479658130492